package ru.psu.eat.servicemodeling.services

import org.springframework.http.ResponseEntity
import ru.psu.eat.servicemodeling.model.CProcess
import java.util.*

/********************************************************************************************************
 * Интерфейс сервиса с бизнес-логикой для работы со списком процессов.                                  *
 * @author Селетков И.П. 2023 0128.                                                                     *
 *******************************************************************************************************/
interface IServiceProcesses {
    /****************************************************************************************************
     * Список всех объектов.                                                                            *
     ***************************************************************************************************/
    fun getAll(
    )                                       : Iterable<CProcess>
    /****************************************************************************************************
     * Поиск объекта по идентификатору.                                                                 *
     * @param id - идентификатор объекта для поиска в формате UUID.                                     *
     ***************************************************************************************************/
    fun getById(
        id                                  : UUID
    )                                       : ResponseEntity<CProcess>
    /****************************************************************************************************
     * Поиск объекта по наименованию.                                                                   *
     * @param name - наименование объекта для поиска.                                                   *
     ***************************************************************************************************/
    fun getByName(
        name                                : String
    )                                       : Iterable<CProcess>
    /****************************************************************************************************
     * Создание/изменение объекта.                                                                      *
     * @param item - данные объекта.                                                                    *
     ***************************************************************************************************/
    fun save(
        item                                : CProcess
    )
    /****************************************************************************************************
     * Удаление объекта.                                                                                *
     * @param item - данные объекта.                                                                    *
     ***************************************************************************************************/
    fun delete(
        item                                : CProcess
    )
    /****************************************************************************************************
     * Удаление объекта по идентификатору.                                                              *
     * @param id - идентификатор объекта для удаления.                                                  *
     ***************************************************************************************************/
    fun deleteById(
        id                                  : UUID
    )                                       : ResponseEntity<String>
}