package ru.psu.eat.servicemodeling.model

import java.util.UUID
import javax.persistence.Column
import javax.persistence.Entity
import javax.persistence.Id
import javax.persistence.Table

/********************************************************************************************************
 * Класс для описания процессов.                                                                        *
 * @author Селетков И.П. 2023 0128.                                                                     *
 *******************************************************************************************************/
@Entity
@Table(name = "processes")
data class CProcess (
    /****************************************************************************************************
     * Идентификатор.                                                                                   *
     ***************************************************************************************************/
    @Id
    var id                                  : UUID?
                                            = null,
    /****************************************************************************************************
     * Наименование.                                                                                    *
     ***************************************************************************************************/
    @Column
    var name                                : String
                                            = ""
)