package ru.psu.eat.servicemodeling.controllers

import org.springframework.http.ResponseEntity
import org.springframework.web.bind.annotation.*
import ru.psu.eat.servicemodeling.model.CProcess
import ru.psu.eat.servicemodeling.services.IServiceProcesses
import java.util.*

/********************************************************************************************************
 * Контроллер REST запросов к справочнику процессов.                                                    *
 * @author Селетков И.П. 2023 0128.                                                                     *
 *******************************************************************************************************/
@RestController
@RequestMapping("/processes")
class CControllerProcesses
/********************************************************************************************************
 * Конструктор.                                                                                         *
 * @param serviceProcesses - сервис с логикой для работы со списком процессов.                          *
 *******************************************************************************************************/
(
    val serviceProcesses                    : IServiceProcesses
)
{
    /****************************************************************************************************
     * Список всех объектов.                                                                            *
     ***************************************************************************************************/
    @GetMapping
    fun getAll()                            : Iterable<CProcess>
    {
        return serviceProcesses.getAll()
    }
    /****************************************************************************************************
     * Поиск объекта по идентификатору.                                                                 *
     * @param id - идентификатор объекта для поиска в формате UUID.                                     *
     ***************************************************************************************************/
    @GetMapping(
        //Этой строкой говорим, что метод вызывать только тогда,
        //когда в параметрах запроса есть параметр id.
        params                              = ["id"]
    )
    fun getById(
        //Значение перменной id заполняется содержимым из параметра запроса id
        @RequestParam id                    : UUID
    )                                       : ResponseEntity<CProcess>
    {
        return serviceProcesses.getById(id)
    }
    /****************************************************************************************************
     * Поиск объекта по наименованию.                                                                   *
     * @param name - наименование объекта для поиска.                                                   *
     ***************************************************************************************************/
    @GetMapping(
        //Говорим веб-серверу, что если в запросе есть такой параметр,
        //то его нужно переадресовать на данный метод,
        //а не на те, которые написаны выше.
        params                              = ["name"]
    )
    fun getByName(
        @RequestParam name                  : String
    )                                       : Iterable<CProcess>
    {
        return serviceProcesses.getByName(name)
    }
    /****************************************************************************************************
     * Создание/изменение объекта.                                                                      *
     * @param item - данные объекта.                                                                    *
     ***************************************************************************************************/
    @PostMapping
    fun save(
        //Данные объекта должны быть в теле запроса.
        @RequestBody item                   : CProcess
    )
    {
        serviceProcesses.save(item)
    }
    /****************************************************************************************************
     * Удаление объекта.                                                                                *
     * @param item - данные объекта.                                                                    *
     ***************************************************************************************************/
    @DeleteMapping
    fun delete(
        //Данные студента должны быть в теле запроса.
        @RequestBody item                   : CProcess
    )
    {
        serviceProcesses.delete(item)
    }
    /****************************************************************************************************
     * Удаление объекта по идентификатору.                                                              *
     * @param id - идентификатор объекта для удаления.                                                  *
     ***************************************************************************************************/
    @DeleteMapping(
        params                              = ["id"]
    )
    fun deleteById(
        @RequestParam id                    : UUID
    )                                       : ResponseEntity<String>
    {
        return serviceProcesses.deleteById(id)
    }
}